#Задание 1
a = "Простите за задержку в выполнении первого домашнего задания,"
b = input("Введите Ваше имя: ")
c = ". Впредь постараюсь не опаздывать."
print(a, b, с)
d = int(input("Введите число и оно будет увеличено вдвое: ")) * 2
print("При умножении на 2 получится:", d)
print("Переходим ко 2 заданию!")