# Задание 6
a = int(input("Введите количество километров в первый день: "))
b = int(input("Введите цель спортсмена, км: "))
cnt = 1
m = a
while m < b:
#    print(m)
#    print(cnt)
    cnt = cnt + 1
    c = 1.1 ** (cnt - 1)
    m = a * c
print("На", cnt, "-й день спортсмен достигнет цели")


